{
  "privacy": {
    "title": "سياسة الخصوصية",
    "lastUpdated": "آخر تحديث",
    "backLink": "→ العودة إلى Traplace",
    "sections": [
      {
        "title": "١. المقدمة",
        "content": "مرحباً بك في Kingshot Traplace (\"نحن\" أو \"ـنا\" أو \"الخاص بنا\"). نحن ملتزمون بحماية خصوصيتك وضمان الشفافية حول كيفية تعاملنا مع البيانات. توضح سياسة الخصوصية هذه المعلومات التي نجمعها وكيفية استخدامها وحقوقك فيما يتعلق ببياناتك."
      },
      {
        "title": "٢. المعلومات التي نجمعها",
        "subsections": [
          {
            "title": "٢.١ بيانات التحليلات المجهولة",
            "content": "بموافقتك، نجمع بيانات استخدام مجهولة من خلال Google Analytics 4 لفهم كيفية استخدام خدمتنا وتحسين تجربة المستخدم. يشمل ذلك:",
            "list": [
              "مشاهدات الصفحات ومدة الزيارة",
              "مصادر الإحالة (كيفية وصولك إلى موقعنا)",
              "نوع المتصفح ومعلومات الجهاز",
              "الموقع الجغرافي العام (على مستوى الدولة/المدينة، وليس دقيقاً)",
              "تفضيل اللغة",
              "ما إذا كنت قد دخلت عبر رابط مختصر (النمط فقط، مثل <code>/s/*</code>)"
            ],
            "notCollected": {
              "title": "نحن لا نجمع:",
              "list": [
                "رموز الروابط المختصرة المحددة",
                "بيانات الخريطة المخزنة في أجزاء تجزئة الرابط",
                "تكوينات الكتل أو التسميات المخصصة",
                "معلومات تعريف شخصية",
                "عناوين IP (يتم إخفاؤها تلقائياً)"
              ]
            }
          },
          {
            "title": "٢.٢ التخزين المحلي للبيانات",
            "content": "يتم تخزين بيانات الخريطة الخاصة بك محلياً في متصفحك عبر:",
            "list": [
              "<strong>أجزاء تجزئة الرابط:</strong> يتم ترميز جميع مواضع الكتل والألوان والتسميات في الرابط بعد رمز <code>#</code>. هذه البيانات لا تغادر متصفحك أبداً إلا إذا شاركت الرابط.",
              "<strong>ملفات تعريف الارتباط:</strong> تُستخدم فقط لتذكر تفضيل موافقتك على التحليلات (<code>traplace_analytics_consent</code>)."
            ]
          },
          {
            "title": "٢.٣ الروابط المختصرة",
            "content": "عندما تنشئ رابطاً مختصراً (<code>/s/&lt;code&gt;</code>)، نقوم بتخزين التعيين مؤقتاً بين الرمز المختصر ومسار الرابط الأصلي الخاص بك في Redis مع فترة صلاحية (TTL). هذه البيانات:",
            "list": [
              "مخزنة لمدة ٧ أيام من آخر دخول",
              "يتم تجديد فترة الصلاحية تلقائياً إلى ٧ أيام عند الدخول إلى الرابط المختصر",
              "غير مرتبطة بأي معلومات شخصية",
              "يتم حذفها تلقائياً بعد انتهاء صلاحيتها"
            ]
          }
        ]
      },
      {
        "title": "٣. كيفية استخدامنا لمعلوماتك",
        "list": [
          "<strong>التحليلات:</strong> لفهم أنماط الاستخدام وتحسين الميزات وإصلاح الأخطاء",
          "<strong>تشغيل الخدمة:</strong> لتوفير وظيفة الروابط المختصرة",
          "<strong>الامتثال القانوني:</strong> للامتثال للقوانين واللوائح المعمول بها"
        ]
      },
      {
        "title": "٤. مشاركة البيانات",
        "content": "نحن لا نبيع أو نؤجر أو نشارك بياناتك مع أطراف ثالثة، باستثناء:",
        "list": [
          "<strong>Google Analytics:</strong> تتم معالجة بيانات التحليلات المجهولة بواسطة Google وفقاً لسياسة الخصوصية الخاصة بهم",
          "<strong>المتطلبات القانونية:</strong> إذا كان ذلك مطلوباً بموجب القانون أو لحماية حقوقنا"
        ]
      },
      {
        "title": "٥. حقوقك",
        "content": "لديك الحق في:",
        "list": [
          "<strong>إلغاء الاشتراك في التحليلات:</strong> انقر على \"رفض\" في لافتة موافقة ملفات تعريف الارتباط",
          "<strong>حذف بياناتك:</strong> امسح ملفات تعريف الارتباط وسجل الروابط في متصفحك. لا يوجد ملف تعريف على الخادم.",
          "<strong>الوصول إلى بياناتك:</strong> جميع بيانات الخريطة الخاصة بك مرئية في جزء تجزئة الرابط"
        ]
      },
      {
        "title": "٦. أمن البيانات",
        "content": "نطبق إجراءات أمنية معقولة تشمل:",
        "list": [
          "تشفير HTTPS لجميع الاتصالات",
          "علامات ملفات تعريف ارتباط آمنة (<code>SameSite=Lax; Secure</code>)",
          "إخفاء عناوين IP في Google Analytics",
          "عدم وجود ملفات تعريف مستخدمين أو حسابات دائمة"
        ]
      },
      {
        "title": "٧. المستخدمون الدوليون",
        "content": "خدمتنا متاحة في جميع أنحاء العالم. قد تتم معالجة بيانات التحليلات بواسطة Google في بلدان مختلفة. نقوم بإخفاء هوية البيانات للامتثال للائحة العامة لحماية البيانات (GDPR) واللوائح المماثلة لحماية الخصوصية."
      },
      {
        "title": "٨. خصوصية الأطفال",
        "content": "خدمتنا لا تستهدف الأطفال دون سن ١٣ عاماً. نحن لا نجمع عن قصد معلومات شخصية من الأطفال."
      },
      {
        "title": "٩. التغييرات على هذه السياسة",
        "content": "قد نقوم بتحديث سياسة الخصوصية هذه من وقت لآخر. سيتم نشر التغييرات على هذه الصفحة مع تاريخ \"آخر تحديث\" محدث."
      },
      {
        "title": "١٠. اتصل بنا",
        "content": "إذا كانت لديك أسئلة حول سياسة الخصوصية هذه، يرجى الاتصال بنا عبر <a href=\"https://github.com/SangwoonYun/Traplace\" target=\"_blank\">مستودع GitHub الخاص بنا</a>."
      }
    ]
  },
  "terms": {
    "title": "شروط الخدمة",
    "lastUpdated": "آخر تحديث",
    "backLink": "→ العودة إلى Traplace",
    "sections": [
      {
        "title": "١. قبول الشروط",
        "content": "بالدخول إلى أو استخدام Kingshot Traplace (\"الخدمة\" أو \"نحن\" أو \"ـنا\" أو \"الخاص بنا\")، فإنك توافق على الالتزام بشروط الخدمة هذه. إذا كنت لا توافق على هذه الشروط، يرجى عدم استخدام الخدمة."
      },
      {
        "title": "٢. وصف الخدمة",
        "content": "Kingshot Traplace هي أداة مساعدة مجانية ومفتوحة المصدر قائمة على الويب للتخطيط والتصور لمواضع التحالفات للعبة المحمول <strong>Kingshot</strong> المطورة بواسطة Century Games Pte. Ltd. تتيح لك الخدمة:",
        "list": [
          "وضع وترتيب الكتل على خريطة قائمة على الشبكة",
          "إنشاء كتل مخصصة بأحجام وألوان مختلفة",
          "مشاركة تخطيطاتك عبر الرابط أو الروابط المختصرة",
          "تصدير خرائطك كصور PNG"
        ]
      },
      {
        "title": "٣. مسؤوليات المستخدم",
        "subsections": [
          {
            "title": "٣.١ الاستخدام المقبول",
            "content": "توافق على استخدام الخدمة فقط للأغراض القانونية. لا يجوز لك:",
            "list": [
              "استخدام الخدمة لمضايقة أو إساءة معاملة أو إيذاء الآخرين",
              "محاولة الحصول على وصول غير مصرح به إلى الخدمة أو بنيتها التحتية",
              "توزيع برامج ضارة أو رسائل غير مرغوب فيها أو محتوى ضار",
              "انتهاك أي قوانين أو لوائح معمول بها",
              "استخدام أنظمة آلية (روبوتات) لإنشاء روابط مختصرة مفرطة"
            ]
          },
          {
            "title": "٣.٢ ملكية المحتوى",
            "content": "تحتفظ بجميع الحقوق في تخطيطات الخرائط والتكوينات التي تنشئها. من خلال مشاركة رابط، فإنك تمنح الآخرين إذناً لعرض ونسخ تخطيطك. نحن لا ندعي ملكية محتواك."
          }
        ]
      },
      {
        "title": "٤. توافر الخدمة",
        "content": "نقدم الخدمة <strong>\"كما هي\" و\"كما هي متاحة\"</strong>. نحن لا نضمن:",
        "list": [
          "التشغيل المستمر أو غير المنقطع أو الخالي من الأخطاء",
          "أن يتم الحفاظ على بياناتك إلى أجل غير مسمى",
          "أن تظل الروابط المختصرة نشطة بعد فترة صلاحيتها"
        ],
        "footer": "نحتفظ بالحق في تعديل أو تعليق أو إيقاف الخدمة في أي وقت دون إشعار."
      },
      {
        "title": "٥. البيانات والخصوصية",
        "list": [
          "يتم تخزين بيانات الخريطة الخاصة بك محلياً في رابط متصفحك. نحن لا نخزن تكوينات الخرائط على خوادمنا.",
          "يتم تخزين الروابط المختصرة مؤقتاً في Redis لمدة ٧ أيام من آخر دخول. كل دخول يجدد فترة الصلاحية لـ ٧ أيام أخرى. تنتهي صلاحية الروابط تلقائياً إذا لم يتم الدخول إليها.",
          "نجمع بيانات التحليلات المجهولة فقط بموافقتك. راجع سياسة الخصوصية الخاصة بنا للحصول على التفاصيل."
        ]
      },
      {
        "title": "٦. الملكية الفكرية",
        "content": "الكود المصدري للخدمة مفتوح المصدر ومتاح على <a href=\"https://github.com/SangwoonYun/Traplace\" target=\"_blank\">GitHub</a>. الكود مرخص بموجب الشروط المحددة في المستودع.",
        "footer": "\"Kingshot\" والعلامات التجارية ذات الصلة هي ملكية لـ Century Games Pte. Ltd. هذه الخدمة هي أداة مساعدة من صنع المعجبين وهي <strong>غير تابعة رسمياً أو معتمدة من قبل أو مرتبطة بـ Century Games Pte. Ltd.</strong> أو مطوري اللعبة بأي شكل من الأشكال. جميع العلامات التجارية وحقوق التأليف والنشر المتعلقة باللعبة تخص أصحابها."
      },
      {
        "title": "٧. إخلاء مسؤولية الضمانات",
        "content": "يتم توفير الخدمة \"كما هي\" دون ضمانات من أي نوع، صريحة أو ضمنية، بما في ذلك على سبيل المثال لا الحصر:",
        "list": [
          "ضمانات القابلية للتسويق",
          "الملاءمة لغرض معين",
          "عدم الانتهاك",
          "دقة أو موثوقية النتائج"
        ]
      },
      {
        "title": "٨. حدود المسؤولية",
        "content": "إلى أقصى حد يسمح به القانون، لن نكون مسؤولين عن أي:",
        "list": [
          "أضرار مباشرة أو غير مباشرة أو عرضية أو تبعية",
          "فقدان البيانات أو الأرباح أو فرص العمل",
          "أضرار ناشئة عن استخدام أو عدم القدرة على استخدام الخدمة"
        ],
        "footer": "ينطبق هذا حتى إذا تم إخطارنا بإمكانية حدوث مثل هذه الأضرار."
      },
      {
        "title": "٩. التعويض",
        "content": "توافق على تعويضنا وإبراء ذمتنا من أي مطالبات أو أضرار أو نفقات ناشئة عن استخدامك للخدمة أو انتهاكك لهذه الشروط."
      },
      {
        "title": "١٠. خدمات الطرف الثالث",
        "content": "تستخدم الخدمة خدمات طرف ثالث تشمل:",
        "list": [
          "<strong>Google Analytics:</strong> تخضع لسياسة الخصوصية والشروط الخاصة بـ Google",
          "<strong>شبكات توصيل المحتوى ومزودي الاستضافة:</strong> تخضع لشروطهم الخاصة"
        ],
        "footer": "نحن لسنا مسؤولين عن خدمات الطرف الثالث أو سياساتهم."
      },
      {
        "title": "١١. التعديلات على الشروط",
        "content": "قد نقوم بتحديث شروط الخدمة هذه في أي وقت. ستكون التغييرات سارية فور نشرها. استمرارك في استخدام الخدمة يشكل قبولاً للشروط المعدلة."
      },
      {
        "title": "١٢. الإنهاء",
        "content": "نحتفظ بالحق في إنهاء أو تقييد وصولك إلى الخدمة في أي وقت، دون إشعار، لأي سبب، بما في ذلك انتهاك هذه الشروط."
      },
      {
        "title": "١٣. القانون الحاكم",
        "content": "تخضع هذه الشروط وتفسر وفقاً لقوانين جمهورية كوريا، دون الإخلال بأحكام تنازع القوانين."
      },
      {
        "title": "١٤. معلومات الاتصال",
        "content": "للأسئلة أو المخاوف حول هذه الشروط، يرجى الاتصال بنا عبر <a href=\"https://github.com/SangwoonYun/Traplace\" target=\"_blank\">مستودع GitHub الخاص بنا</a>."
      }
    ]
  },
  "footer": {
    "home": "الرئيسية",
    "privacy": "سياسة الخصوصية",
    "terms": "شروط الخدمة",
    "github": "GitHub"
  }
}
