{
  "privacy": {
    "title": "นโยบายความเป็นส่วนตัว",
    "lastUpdated": "อัปเดตล่าสุด",
    "backLink": "← กลับไปที่ Traplace",
    "sections": [
      {
        "title": "1. บทนำ",
        "content": "ยินดีต้อนรับสู่ Kingshot Traplace (\"เรา\", \"ของเรา\" หรือ \"แก่เรา\") เรามุ่งมั่นที่จะปกป้องความเป็นส่วนตัวของคุณและรับรองความโปร่งใสเกี่ยวกับวิธีที่เราจัดการข้อมูล นโยบายความเป็นส่วนตัวนี้อธิบายข้อมูลที่เรารวบรวม วิธีการใช้งาน และสิทธิของคุณเกี่ยวกับข้อมูลของคุณ"
      },
      {
        "title": "2. ข้อมูลที่เรารวบรวม",
        "subsections": [
          {
            "title": "2.1 ข้อมูลการวิเคราะห์แบบไม่ระบุตัวตน",
            "content": "ด้วยความยินยอมของคุณ เรารวบรวมข้อมูลการใช้งานแบบไม่ระบุตัวตนผ่าน Google Analytics 4 เพื่อทำความเข้าใจว่าบริการของเราถูกใช้งานอย่างไรและปรับปรุงประสบการณ์ผู้ใช้ ซึ่งรวมถึง:",
            "list": [
              "การดูหน้าและระยะเวลาการเยี่ยมชม",
              "แหล่งอ้างอิง (คุณพบไซต์ของเราได้อย่างไร)",
              "ประเภทเบราว์เซอร์และข้อมูลอุปกรณ์",
              "ตำแหน่งทางภูมิศาสตร์ทั่วไป (ระดับประเทศ/เมือง ไม่ใช่ตำแหน่งที่แม่นยำ)",
              "การตั้งค่าภาษา",
              "ว่าคุณเข้าถึงผ่าน URL ย่อหรือไม่ (เฉพาะรูปแบบ เช่น <code>/s/*</code>)"
            ],
            "notCollected": {
              "title": "เราไม่รวบรวม:",
              "list": [
                "รหัส URL ย่อเฉพาะเจาะจง",
                "ข้อมูลแผนที่ของคุณที่จัดเก็บในส่วน hash ของ URL",
                "การกำหนดค่าบลอกหรือป้ายกำกับที่กำหนดเอง",
                "ข้อมูลระบุตัวตนส่วนบุคคล",
                "ที่อยู่ IP (ทำให้ไม่ระบุตัวตนโดยอัตโนมัติ)"
              ]
            }
          },
          {
            "title": "2.2 การจัดเก็บข้อมูลในเครื่อง",
            "content": "ข้อมูลแผนที่ของคุณจะถูกจัดเก็บในเบราว์เซอร์ของคุณในเครื่องผ่าน:",
            "list": [
              "<strong>ส่วน Hash ของ URL:</strong> ตำแหน่งบลอก สี และป้ายกำกับทั้งหมดถูกเข้ารหัสใน URL หลังสัญลักษณ์ <code>#</code> ข้อมูลนี้จะไม่ออกจากเบราว์เซอร์ของคุณเว้นแต่คุณจะแชร์ URL",
              "<strong>คุกกี้:</strong> ใช้เฉพาะเพื่อจำการตั้งค่าความยินยอมการวิเคราะห์ของคุณ (<code>traplace_analytics_consent</code>)"
            ]
          },
          {
            "title": "2.3 URL ย่อ",
            "content": "เมื่อคุณสร้าง URL ย่อ (<code>/s/&lt;code&gt;</code>) เราจะจัดเก็บการแมประหว่างรหัสสั้นและเส้นทาง URL เดิมของคุณใน Redis ชั่วคราวพร้อมกับเวลามีชีวิต (TTL) ข้อมูลนี้คือ:",
            "list": [
              "จัดเก็บเป็นเวลา 7 วันนับจากการเข้าถึงครั้งล่าสุด",
              "TTL จะต่ออายุโดยอัตโนมัติเป็น 7 วันเมื่อมีการเข้าถึง URL ย่อ",
              "ไม่เชื่อมโยงกับข้อมูลส่วนบุคคลใดๆ",
              "ถูกลบโดยอัตโนมัติหลังจากหมดอายุ"
            ]
          }
        ]
      },
      {
        "title": "3. วิธีที่เราใช้ข้อมูลของคุณ",
        "list": [
          "<strong>การวิเคราะห์:</strong> เพื่อทำความเข้าใจรูปแบบการใช้งาน ปรับปรุงคุณสมบัติ และแก้ไขข้อบกพร่อง",
          "<strong>การดำเนินงานบริการ:</strong> เพื่อให้ฟังก์ชันการทำงาน URL ย่อ",
          "<strong>การปฏิบัติตามกฎหมาย:</strong> เพื่อปฏิบัติตามกฎหมายและข้อบังคับที่บังคับใช้"
        ]
      },
      {
        "title": "4. การแบ่งปันข้อมูล",
        "content": "เราไม่ขาย เช่า หรือแบ่งปันข้อมูลของคุณกับบุคคลที่สาม ยกเว้น:",
        "list": [
          "<strong>Google Analytics:</strong> ข้อมูลการวิเคราะห์แบบไม่ระบุตัวตนได้รับการประมวลผลโดย Google ตามนโยบายความเป็นส่วนตัวของพวกเขา",
          "<strong>ข้อกำหนดทางกฎหมาย:</strong> หากกฎหมายกำหนดหรือเพื่อปกป้องสิทธิของเรา"
        ]
      },
      {
        "title": "5. สิทธิของคุณ",
        "content": "คุณมีสิทธิที่จะ:",
        "list": [
          "<strong>ปฏิเสธการวิเคราะห์:</strong> คลิก \"ปฏิเสธ\" บนแบนเนอร์ความยินยอมคุกกี้",
          "<strong>ลบข้อมูลของคุณ:</strong> ล้างคุกกี้เบราว์เซอร์และประวัติ URL ของคุณ ไม่มีโปรไฟล์ฝั่งเซิร์ฟเวอร์",
          "<strong>เข้าถึงข้อมูลของคุณ:</strong> ข้อมูลแผนที่ทั้งหมดของคุณสามารถมองเห็นได้ในส่วน hash ของ URL"
        ]
      },
      {
        "title": "6. ความปลอดภัยของข้อมูล",
        "content": "เราใช้มาตรการความปลอดภัยที่สมเหตุสมผล รวมถึง:",
        "list": [
          "การเข้ารหัส HTTPS สำหรับการเชื่อมต่อทั้งหมด",
          "แฟล็กคุกกี้ที่ปลอดภัย (<code>SameSite=Lax; Secure</code>)",
          "การทำให้ที่อยู่ IP ไม่ระบุตัวตนใน Google Analytics",
          "ไม่มีโปรไฟล์ผู้ใช้หรือบัญชีถาวร"
        ]
      },
      {
        "title": "7. ผู้ใช้ระหว่างประเทศ",
        "content": "บริการของเราสามารถเข้าถึงได้ทั่วโลก ข้อมูลการวิเคราะห์อาจได้รับการประมวลผลโดย Google ในประเทศต่างๆ เราทำให้ข้อมูลไม่ระบุตัวตนเพื่อปฏิบัติตาม GDPR และข้อบังคับความเป็นส่วนตัวที่คล้ายคลึงกัน"
      },
      {
        "title": "8. ความเป็นส่วนตัวของเด็ก",
        "content": "บริการของเราไม่ได้กำหนดเป้าหมายเด็กอายุต่ำกว่า 13 ปี เราไม่รวบรวมข้อมูลส่วนบุคคลจากเด็กโดยรู้เท่าทัน"
      },
      {
        "title": "9. การเปลี่ยนแปลงนโยบายนี้",
        "content": "เราอาจอัปเดตนโยบายความเป็นส่วนตัวนี้เป็นครั้งคราว การเปลี่ยนแปลงจะถูกโพสต์บนหน้านี้พร้อมวันที่ \"อัปเดตล่าสุด\" ที่อัปเดต"
      },
      {
        "title": "10. ติดต่อเรา",
        "content": "หากคุณมีคำถามเกี่ยวกับนโยบายความเป็นส่วนตัวนี้ โปรดติดต่อเราผ่าน<a href=\"https://github.com/SangwoonYun/Traplace\" target=\"_blank\">ที่เก็บ GitHub ของเรา</a>"
      }
    ]
  },
  "terms": {
    "title": "ข้อกำหนดการให้บริการ",
    "lastUpdated": "อัปเดตล่าสุด",
    "backLink": "← กลับไปที่ Traplace",
    "sections": [
      {
        "title": "1. การยอมรับข้อกำหนด",
        "content": "โดยการเข้าถึงหรือใช้ Kingshot Traplace (\"บริการ\", \"เรา\", \"ของเรา\" หรือ \"แก่เรา\") คุณตกลงที่จะผูกพันตามข้อกำหนดการให้บริการเหล่านี้ หากคุณไม่เห็นด้วยกับข้อกำหนดเหล่านี้ โปรดอย่าใช้บริการ"
      },
      {
        "title": "2. คำอธิบายบริการ",
        "content": "Kingshot Traplace เป็นเครื่องมือช่วยเหลือบนเว็บที่เป็นโอเพนซอร์สฟรีสำหรับการวางแผนและแสดงภาพการวางตำแหน่งพันธมิตรสำหรับเกมมือถือ <strong>Kingshot</strong> ที่พัฒนาโดย Century Games Pte. Ltd. บริการช่วยให้คุณสามารถ:",
        "list": [
          "วางและจัดเรียงบลอกบนแผนที่กริด",
          "สร้างบลอกที่กำหนดเองด้วยขนาดและสีที่แตกต่างกัน",
          "แบ่งปันเค้าโครงของคุณผ่าน URL หรือลิงก์ย่อ",
          "ส่งออกแผนที่ของคุณเป็นภาพ PNG"
        ]
      },
      {
        "title": "3. ความรับผิดชอบของผู้ใช้",
        "subsections": [
          {
            "title": "3.1 การใช้งานที่ยอมรับได้",
            "content": "คุณตกลงที่จะใช้บริการเพื่อวัตถุประสงค์ที่ถูกกฎหมายเท่านั้น คุณห้าม:",
            "list": [
              "ใช้บริการเพื่อล่วงละเมิด ทำร้าย หรือเป็นอันตรายต่อผู้อื่น",
              "พยายามเข้าถึงบริการหรือโครงสร้างพื้นฐานโดยไม่ได้รับอนุญาต",
              "แจกจ่ายมัลแวร์ สแปม หรือเนื้อหาที่เป็นอันตราย",
              "ละเมิดกฎหมายหรือข้อบังคับที่บังคับใช้",
              "ใช้ระบบอัตโนมัติ (บอท) เพื่อสร้าง URL ย่อมากเกินไป"
            ]
          },
          {
            "title": "3.2 กwłasność เนื้อหา",
            "content": "คุณเก็บสิทธิทั้งหมดในเค้าโครงแผนที่และการกำหนดค่าที่คุณสร้างขึ้น การแบ่งปัน URL คุณให้สิทธิแก่ผู้อื่นในการดูและคัดลอกเค้าโครงของคุณ เราไม่อ้างสิทธิความเป็นเจ้าของเนื้อหาของคุณ"
          }
        ]
      },
      {
        "title": "4. ความพร้อมใช้งานของบริการ",
        "content": "เราให้บริการบนพื้นฐาน <strong>\"ตามสภาพ\" และ \"ตามที่มีอยู่\"</strong> เราไม่รับประกัน:",
        "list": [
          "การดำเนินการอย่างต่อเนื่อง ไม่หยุดชะงัก หรือปราศจากข้อผิดพลาด",
          "ว่าข้อมูลของคุณจะถูกเก็บรักษาไว้ไม่มีกำหนด",
          "ว่า URL ย่อจะยังคงใช้งานได้เกินกว่าระยะเวลา TTL"
        ],
        "footer": "เราสงวนสิทธิ์ในการแก้ไข ระงับ หรือยุติบริการได้ตลอดเวลาโดยไม่ต้องแจ้งให้ทราบล่วงหน้า"
      },
      {
        "title": "5. ข้อมูลและความเป็นส่วนตัว",
        "list": [
          "ข้อมูลแผนที่ของคุณจะถูกจัดเก็บในเครื่องใน URL ของเบราว์เซอร์ของคุณ เราไม่จัดเก็บการกำหนดค่าแผนที่บนเซิร์ฟเวอร์ของเรา",
          "URL ย่อถูกแคชชั่วคราวใน Redis เป็นเวลา 7 วันนับจากการเข้าถึงครั้งล่าสุด การเข้าถึงแต่ละครั้งจะต่ออายุ TTL อีก 7 วัน URL จะหมดอายุโดยอัตโนมัติหากไม่มีการเข้าถึง",
          "เรารวบรวมข้อมูลการวิเคราะห์แบบไม่ระบุตัวตนเฉพาะด้วยความยินยอมของคุณ ดูรายละเอียดในนโยบายความเป็นส่วนตัวของเรา"
        ]
      },
      {
        "title": "6. ทรัพย์สินทางปัญญา",
        "content": "โค้ดต้นฉบับของบริการเป็นโอเพนซอร์สและมีอยู่บน <a href=\"https://github.com/SangwoonYun/Traplace\" target=\"_blank\">GitHub</a> โค้ดได้รับอนุญาตภายใต้เงื่อนไขที่ระบุในที่เก็บ",
        "footer": "\"Kingshot\" และเครื่องหมายการค้าที่เกี่ยวข้องเป็นทรัพย์สินของ Century Games Pte. Ltd. บริการนี้เป็นเครื่องมือช่วยเหลือที่สร้างโดยแฟนและ<strong>ไม่ได้เชื่อมโยง รับรอง หรือเกี่ยวข้องกับ Century Games Pte. Ltd. หรือผู้พัฒนาเกมอย่างเป็นทางการไม่ว่าในทางใดๆ</strong> เครื่องหมายการค้าและลิขสิทธิ์ที่เกี่ยวข้องกับเกมทั้งหมดเป็นของเจ้าของที่เกี่ยวข้อง"
      },
      {
        "title": "7. การปฏิเสธการรับประกัน",
        "content": "บริการนี้มีให้ \"ตามสภาพ\" โดยไม่มีการรับประกันใดๆ ไม่ว่าโดยชัดแจ้งหรือโดยนัยรวมถึงแต่ไม่จำกัดเพียง:",
        "list": [
          "การรับประกันความสามารถในการขาย",
          "ความเหมาะสมสำหรับวัตถุประสงค์เฉพาะ",
          "การไม่ละเมิด",
          "ความถูกต้องหรือความน่าเชื่อถือของผลลัพธ์"
        ]
      },
      {
        "title": "8. ข้อจำกัดความรับผิด",
        "content": "ในขอบเขตสูงสุดที่กฎหมายอนุญาต เราจะไม่รับผิดชอบต่อ:",
        "list": [
          "ความเสียหายโดยตรง โดยอ้อม โดยบังเอิญ หรือเป็นผลสืบเนื่อง",
          "การสูญเสียข้อมูล กำไร หรือโอกาสทางธุรกิจ",
          "ความเสียหายที่เกิดจากการใช้หรือไม่สามารถใช้บริการได้"
        ],
        "footer": "สิ่งนี้ใช้แม้ว่าเราจะได้รับการแจ้งเตือนถึงความเป็นไปได้ของความเสียหายดังกล่าว"
      },
      {
        "title": "9. การชดใช้ค่าเสียหาย",
        "content": "คุณตกลงที่จะชดใช้และปกป้องเราจากการเรียกร้อง ความเสียหาย หรือค่าใช้จ่ายใดๆ ที่เกิดจากการใช้บริการของคุณหรือการละเมิดข้อกำหนดเหล่านี้"
      },
      {
        "title": "10. บริการบุคคลที่สาม",
        "content": "บริการใช้บริการบุคคลที่สามรวมถึง:",
        "list": [
          "<strong>Google Analytics:</strong> ภายใต้นโยบายความเป็นส่วนตัวและข้อกำหนดของ Google",
          "<strong>CDN และผู้ให้บริการโฮสติ้ง:</strong> ภายใต้ข้อกำหนดของพวกเขา"
        ],
        "footer": "เราไม่รับผิดชอบต่อบริการบุคคลที่สามหรือนโยบายของพวกเขา"
      },
      {
        "title": "11. การแก้ไขข้อกำหนด",
        "content": "เราอาจอัปเดตข้อกำหนดการให้บริการเหล่านี้ได้ตลอดเวลา การเปลี่ยนแปลงจะมีผลทันทีเมื่อโพสต์ การใช้บริการต่อไปของคุณถือเป็นการยอมรับข้อกำหนดที่แก้ไข"
      },
      {
        "title": "12. การยกเลิก",
        "content": "เราสงวนสิทธิ์ในการยกเลิกหรือจำกัดการเข้าถึงบริการของคุณได้ตลอดเวลา โดยไม่ต้องแจ้งให้ทราบ ด้วยเหตุผลใดๆ รวมถึงการละเมิดข้อกำหนดเหล่านี้"
      },
      {
        "title": "13. กฎหมายที่ใช้บังคับ",
        "content": "ข้อกำหนดเหล่านี้จะอยู่ภายใต้และตีความตามกฎหมายของสาธารณรัฐเกาหลี โดยไม่คำนึงถึงบทบัญญัติเกี่ยวกับความขัดแย้งของกฎหมาย"
      },
      {
        "title": "14. ข้อมูลการติดต่อ",
        "content": "สำหรับคำถามหรือข้อกังวลเกี่ยวกับข้อกำหนดเหล่านี้ โปรดติดต่อเราผ่าน<a href=\"https://github.com/SangwoonYun/Traplace\" target=\"_blank\">ที่เก็บ GitHub ของเรา</a>"
      }
    ]
  },
  "footer": {
    "home": "หน้าแรก",
    "privacy": "นโยบายความเป็นส่วนตัว",
    "terms": "ข้อกำหนดการให้บริการ",
    "github": "GitHub"
  }
}
